Catalogs/ВидыАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ВидыАлкогольнойПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодВидаПродукции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдаленаВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийНаПродажуАлкоголя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркируемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыЛицензийНаПродажуАлкоголя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыЛицензийНаПродажуАлкоголя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяПищеваяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяНеПищеваяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спирт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЛицензийАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыЛицензийАлкогольнойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяПищеваяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяНеПищеваяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спирт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыАлкогольнойПродукции/Ext/ManagerModule.bsl
//#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ИнтеграцияЕГАИСВызовСервера.ПриПолученииФормыСправочника(
		"ВидыАлкогольнойПродукции",
		ВидФормы,
		Параметры,
		ВыбраннаяФорма,
		ДополнительнаяИнформация,
		СтандартнаяОбработка);
	
КонецПроцедуры

//#КонецОбласти

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	ЭлементыДляОбработки = Справочники.ВидыАлкогольнойПродукции.Выбрать();
	
	Пока ЭлементыДляОбработки.Следующий() Цикл
		
		Если (Не ЗначениеЗаполнено(ЭлементыДляОбработки.ВидЛицензии)) И значениеЗаполнено(ЭлементыДляОбработки.УдаленаВидЛицензии) Тогда
			ЭлементДляОбработки = ЭлементыДляОбработки.ПолучитьОбъект();
			ЭлементДляОбработки.ВидЛицензии = ?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.АлкогольнаяПродукция, Перечисления.ВидыЛицензийАлкогольнойПродукции.АлкогольнаяПродукция,
				?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.Пиво, Перечисления.ВидыЛицензийАлкогольнойПродукции.Пиво,
					?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.Спирт, Перечисления.ВидыЛицензийАлкогольнойПродукции.Спирт,
						?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.СпиртосодержащаяНеПищеваяПродукция, Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяНеПищеваяПродукция,
							Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяПищеваяПродукция
						)
					)
				));
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементДляОбработки);
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры
